Repository: plasticfennekfox/swiftui-feature-gallery
Catalog: UIFeatureGalleryApp/*.lproj/Localizable.strings
Languages: ru

# root.title
source: SwiftUI Feature Catalog
ru: Каталог SwiftUI Feature

# route.catalog.title
source: Catalog
ru: Каталог

# route.forms.title
source: Forms
ru: Формы

# route.lists.title
source: Lists
ru: Списки

# route.navigation.title
source: Navigation
ru: Навигация

# route.textRich.title
source: Text & Rich
ru: Текст и форматирование

# route.animations.title
source: Animations
ru: Анимации

# route.gesturesDnD.title
source: Gestures & Drag&Drop
ru: Жесты и Drag&Drop

# route.charts.title
source: Charts
ru: Графики

# route.imagesDrawing.title
source: Images & Drawing
ru: Изображения и рисование

# route.networking.title
source: Networking
ru: Сеть

# route.widgets.title
source: Widgets / Live Activities
ru: Виджеты / Live Activities

# route.uikitInterop.title
source: UIKit Interop
ru: Интеграция с UIKit

# route.mapsStatic.title
source: Static Map
ru: Статическая карта

# catalog.title
source: Catalog
ru: Каталог

# catalog.subtitle
source: Pick a feature to open its demo screens.
ru: Выберите раздел, чтобы открыть демо-экраны.

# catalog.section.features
source: Features
ru: Разделы

# forms.title
source: Forms
ru: Формы

# forms.field.name
source: Name
ru: Имя

# forms.toggle.option
source: Toggle option
ru: Переключатель

# forms.date
source: Date
ru: Дата

# forms.submit
source: Submit
ru: Отправить

# navigation.title
source: Navigation
ru: Навигация

# navigation.openSheet
source: Open Sheet
ru: Открыть шторку

# navigation.showPopover
source: Show Popover
ru: Показать поповер

# navigation.sheet.content
source: Sheet content
ru: Содержимое шторки

# navigation.popover.content
source: Popover
ru: Содержимое поповера

# animations.title
source: Animations
ru: Анимации

# animations.implicit.title
source: Implicit animation
ru: Неявная анимация

# animations.implicit.subtitle
source: Changes are animated automatically when state updates.
ru: Изменения анимируются автоматически при обновлении состояния.

# animations.implicit.button.on
source: Turn ON
ru: Включить

# animations.implicit.button.off
source: Turn OFF
ru: Выключить

# animations.explicit.title
source: Explicit animation
ru: Явная анимация

# animations.explicit.subtitle
source: Use withAnimation for more control.
ru: Используйте withAnimation для большего контроля.

# animations.explicit.button.animate
source: Animate bars
ru: Анимировать столбцы

# animations.explicit.button.reset
source: Reset bars
ru: Сбросить столбцы

# animations.matched.subtitle
source: Animate a view moving between containers.
ru: Анимация перемещения view между контейнерами.

# animations.matched.left
source: Left
ru: Слева

# animations.matched.right
source: Right
ru: Справа

# animations.matched.badge
source: NEW
ru: НОВОЕ

# animations.matched.button.toggleBadge
source: Toggle badge position
ru: Переключить позицию бейджа

# animations.phase.subtitle
source: Animate through multiple phases with a single declaration.
ru: Анимируйте несколько фаз одной декларацией.

# charts.line.title
source: Line chart
ru: Линейный график

# charts.line.subtitle
source: Simple trend over days of the week.
ru: Простая динамика по дням недели.

# charts.bar.title
source: Bar chart
ru: Столбчатый график

# charts.bar.subtitle
source: Compare categories using BarMark.
ru: Сравнение категорий с помощью BarMark.

# charts.mixed.title
source: Mixed chart
ru: Смешанный график

# charts.mixed.subtitle
source: Area + rule mark (average).
ru: Площадь и линия среднего значения.

# charts.axis.day
source: Day
ru: День

# charts.axis.value
source: Value
ru: Значение

# charts.axis.minutes
source: Minutes
ru: Минуты

# charts.axis.category
source: Category
ru: Категория

# charts.axis.average
source: Average
ru: Среднее

# charts.bar.selected
source: Selected: %@
ru: Выбрано: %@

# charts.bar.legend.hint
source: Tap a row in legend below to select a category.
ru: Нажмите на строку в легенде ниже, чтобы выбрать категорию.

# charts.mixed.averageValue
source: Average: %d
ru: Среднее: %d

# charts.weekday.mon
source: Mon
ru: Пн

# charts.weekday.tue
source: Tue
ru: Вт

# charts.weekday.wed
source: Wed
ru: Ср

# charts.weekday.thu
source: Thu
ru: Чт

# charts.weekday.fri
source: Fri
ru: Пт

# charts.weekday.sat
source: Sat
ru: Сб

# charts.weekday.sun
source: Sun
ru: Вс

# charts.category.focus
source: Focus
ru: Фокус

# charts.category.meetings
source: Meetings
ru: Встречи

# charts.category.coding
source: Coding
ru: Разработка

# charts.category.review
source: Review
ru: Код-ревью

# forms.section.account
source: Account
ru: Аккаунт

# forms.section.preferences
source: Preferences
ru: Настройки

# forms.section.about
source: About you
ru: О вас

# forms.progress.title
source: Completion
ru: Заполнение

# forms.field.password
source: Password (min 6)
ru: Пароль (не менее 6 символов)

# forms.field.role
source: Role
ru: Роль

# forms.field.reminderDate
source: Reminder date
ru: Дата напоминания

# forms.field.favoriteColor
source: Favorite color
ru: Любимый цвет

# forms.toggle.notifications
source: Enable notifications
ru: Включить уведомления

# forms.toggle.newsletter
source: Subscribe to newsletter
ru: Подписаться на рассылку

# forms.toggle.acceptTerms
source: I accept the Terms of Service
ru: Я принимаю условия использования

# forms.age.label
source: Age: %d
ru: Возраст: %d

# forms.slider.satisfaction
source: Satisfaction: %d%%
ru: Удовлетворенность: %d%%

# forms.progress.text
source: %d%% filled
ru: Заполнено на %d%%

# forms.role.user
source: User
ru: Пользователь

# forms.role.admin
source: Admin
ru: Администратор

# forms.role.guest
source: Guest
ru: Гость

# forms.alert.submitted.title
source: Form submitted
ru: Форма отправлена

# forms.alert.submitted.message
source: We have logged your form in analytics.
ru: Мы записали данные формы в аналитику.

# forms.validation.error
source: Please fill in required fields and accept the terms.
ru: Пожалуйста, заполните обязательные поля и примите условия использования.

# gestures.basic.title
source: Basic gestures
ru: Базовые жесты

# gestures.basic.subtitle
source: Tap, double tap and long press.
ru: Одиночный тап, двойной тап и долгое нажатие.

# gestures.basic.tapArea.title
source: Tap area
ru: Область касания

# gestures.basic.tapCount
source: Taps: %d
ru: Касаний: %d

# gestures.basic.longPressed
source: Long pressed
ru: Долгое нажатие выполнено

# gestures.basic.longPressHint
source: Long press me
ru: Нажмите и удерживайте

# gestures.drag.title
source: Drag gesture
ru: Жест перетаскивания

# gestures.drag.subtitle
source: Drag the card and it will spring back to the center.
ru: Перетащите карточку, и она вернётся в центр с анимацией.

# gestures.drag.label
source: Drag me
ru: Перетащите меня

# gestures.dnd.title
source: Drag & Drop between columns
ru: Перетаскивание между колонками

# gestures.dnd.subtitle
source: Drag items between the left and right columns.
ru: Перетаскивайте элементы между левой и правой колонками.

# gestures.dnd.columnA
source: Column A
ru: Колонка A

# gestures.dnd.columnB
source: Column B
ru: Колонка B

# gestures.dnd.placeholder
source: Drop items here
ru: Перетащите элементы сюда

# gestures.dnd.item.alpha.title
source: Alpha
ru: Альфа

# gestures.dnd.item.bravo.title
source: Bravo
ru: Браво

# gestures.dnd.item.charlie.title
source: Charlie
ru: Чарли

# gestures.dnd.item.delta.title
source: Delta
ru: Дельта

# gestures.dnd.item.echo.title
source: Echo
ru: Эхо

# gestures.dnd.item.subtitle.columnA
source: From A column
ru: Из колонки A

# gestures.dnd.item.subtitle.columnB
source: From B column
ru: Из колонки B

# images.basic.title
source: Basic images
ru: Базовые изображения

# images.basic.subtitle
source: SF Symbols, rendering modes and aspect ratio.
ru: SF Symbols, режимы отрисовки и соотношение сторон.

# images.masks.title
source: Masks & overlays
ru: Маски и наложения

# images.masks.subtitle
source: Linear gradient masked by rounded rectangle with overlay text.
ru: Линейный градиент с маской скруглённого прямоугольника и наложенным текстом.

# images.masks.headerTitle
source: Gradient card
ru: Градиентная карточка

# images.masks.headerSubtitle
source: Mask, overlay & shadows
ru: Маска, наложения и тени

# images.canvas.subtitle
source: Custom drawing with Canvas and shapes.
ru: Произвольный рисунок с помощью Canvas и фигур.

# images.freeDrawing.title
source: Free drawing
ru: Свободное рисование

# images.freeDrawing.subtitle
source: Draw with your finger (mouse in simulator).
ru: Рисуйте пальцем (мышью в симуляторе).

# images.freeDrawing.clearButton
source: Clear
ru: Очистить

# lists.title
source: Lists
ru: Списки

# lists.toolbar.filterFavorites.help
source: Show only favorites
ru: Показать только избранное

# lists.toolbar.add.accessibilityLabel
source: Add item
ru: Добавить элемент

# lists.search.prompt
source: Search items
ru: Поиск по элементам

# lists.section.static
source: Static examples
ru: Статические примеры

# lists.section.dynamic
source: Editable list
ru: Редактируемый список

# lists.static.row.plain
source: Plain row
ru: Обычная строка

# lists.static.row.detail
source: With detail
ru: Со строкой описания

# lists.static.row.badgeTitle
source: With badge
ru: Со значком

# lists.static.row.badgeLabel
source: NEW
ru: НОВОЕ

# lists.emptyState
source: No items match your filters
ru: Нет элементов, удовлетворяющих фильтрам

# lists.action.favorite
source: Favorite
ru: В избранное

# lists.action.unfavorite
source: Unfavorite
ru: Убрать из избранного

# lists.action.delete
source: Delete
ru: Удалить

# lists.item.titlePattern
source: Item %d
ru: Элемент %d

# lists.item.subtitleCreatedNow
source: Created now
ru: Создано сейчас

# lists.sample.subtitlePattern
source: Subtitle %d
ru: Подзаголовок %d

# maps.overview.title
source: Overview
ru: Обзор

# maps.overview.subtitle
source: Static map previews with predefined regions and annotations. No location services are used.
ru: Статические превью карты с предопределёнными регионами и точками. Службы геолокации не используются.

# maps.simple.title
source: Simple static preview
ru: Простое статичное превью

# maps.simple.subtitle
source: Non-interactive map centered on Apple Park.
ru: Неинтерактивная карта, центрированная на Apple Park.

# maps.presets.title
source: Regions (presets)
ru: Регионы (пресеты)

# maps.presets.subtitle
source: Switch between predefined cities without user gestures.
ru: Переключайтесь между заранее заданными городами без жестов пользователя.

# maps.presets.picker.label
source: Region
ru: Регион

# maps.presets.showing
source: Showing: %@
ru: Показан регион: %@

# maps.annotations.title
source: Annotations
ru: Аннотации

# maps.annotations.subtitle
source: Custom markers for several locations on a static map.
ru: Пользовательские маркеры для нескольких локаций на статичной карте.

# maps.preset.sanFrancisco
source: San Francisco
ru: Сан-Франциско

# maps.preset.london
source: London
ru: Лондон

# maps.location.applePark.title
source: Apple Park, Cupertino
ru: Apple Park, Купертино

# maps.location.sanFrancisco.title
source: San Francisco, CA
ru: Сан-Франциско, Калифорния

# maps.location.london.title
source: London, UK
ru: Лондон, Великобритания

# maps.location.london.short
source: London
ru: Лондон

# navigation.links.title
source: Navigation links
ru: Навигационные ссылки

# navigation.links.subtitle
source: Push detail screens using NavigationLink.
ru: Открывайте детальные экраны с помощью NavigationLink.

# navigation.link.detailA.title
source: Detail A
ru: Деталь A

# navigation.link.detailB.title
source: Detail B
ru: Деталь B

# navigation.link.detailA
source: Go to Detail A
ru: Перейти к детали A

# navigation.link.detailB
source: Go to Detail B
ru: Перейти к детали B

# navigation.sheetsCard.title
source: Sheets & full screen covers
ru: Шторки и полноэкранные окна

# navigation.sheetsCard.subtitle
source: Present modals using sheet and fullScreenCover.
ru: Показывайте модальные экраны через sheet и fullScreenCover.

# navigation.buttons.fullScreen
source: Full screen
ru: На весь экран

# navigation.dialogsCard.title
source: Dialogs & menus
ru: Диалоги и меню

# navigation.dialogsCard.subtitle
source: confirmationDialog and inline Menu.
ru: Пример confirmationDialog и встроенного меню.

# navigation.buttons.showConfirmDialog
source: Show confirmation dialog
ru: Показать диалог подтверждения

# navigation.inlineMenu.label
source: Open inline menu
ru: Открыть встроенное меню

# navigation.menu.settings
source: Settings
ru: Настройки

# navigation.menu.markAllRead
source: Mark all as read
ru: Отметить всё как прочитанное

# navigation.menu.clearHistory
source: Clear history
ru: Очистить историю

# navigation.toolbar.menu.logEvent
source: Log analytics event
ru: Отправить событие аналитики

# navigation.toolbar.menu.refresh
source: Refresh
ru: Обновить

# navigation.confirm.title
source: Are you sure?
ru: Вы уверены?

# navigation.confirm.message
source: This is a confirmationDialog example.
ru: Это пример диалога confirmationDialog.

# navigation.confirm.primary
source: Primary action
ru: Основное действие

# navigation.confirm.destructive
source: Destructive
ru: Опасное действие

# navigation.confirm.cancel
source: Cancel
ru: Отмена

# navigation.status.prefix
source: Last action: %@
ru: Последнее действие: %@

# navigation.status.none
source: No actions yet
ru: Пока действий не было

# navigation.status.primary
source: Primary confirmation action
ru: Основное действие подтверждения

# navigation.status.destructive
source: Destructive confirmation action
ru: Опасное действие подтверждения

# navigation.status.cancelled
source: Cancelled
ru: Отменено

# navigation.status.menu.settings
source: Menu: Open settings
ru: Меню: Открыть настройки

# navigation.status.menu.markRead
source: Menu: Mark all as read
ru: Меню: Отметить всё как прочитанное

# navigation.status.menu.clearHistory
source: Menu: Clear history
ru: Меню: Очистить историю

# navigation.status.toolbar.logged
source: Logged toolbar event
ru: Событие аналитики отправлено

# navigation.status.toolbar.refreshed
source: Refreshed content
ru: Контент обновлён

# navigation.tabsCard.title
source: TabView preview
ru: Превью TabView

# navigation.tabsCard.subtitle
source: Embedded TabView for demonstration.
ru: Встроенный TabView для демонстрации.

# navigation.tab.home.contentTitle
source: Home tab
ru: Вкладка «Домой»

# navigation.tab.favorites.contentTitle
source: Favorites tab
ru: Вкладка «Избранное»

# navigation.tab.profile.contentTitle
source: Profile tab
ru: Вкладка «Профиль»

# navigation.tab.home.tabItem
source: Home
ru: Домой

# navigation.tab.favorites.tabItem
source: Favorites
ru: Избранное

# navigation.tab.profile.tabItem
source: Profile
ru: Профиль

# navigation.tab.selectedTemplate
source: Selected tab: %@
ru: Выбрана вкладка: %@

# navigation.sheet.title
source: Sheet
ru: Шторка

# navigation.sheet.description
source: This sheet is presented using .sheet.
ru: Эта шторка показана через .sheet.

# navigation.button.close
source: Close
ru: Закрыть

# navigation.fullscreen.title
source: Full screen cover
ru: Полноэкранное окно

# navigation.fullscreen.description
source: Presented using .fullScreenCover.
ru: Показано с помощью .fullScreenCover.

# textRich.typography.title
source: Typography
ru: Типографика

# textRich.typography.largeTitle
source: Large title
ru: Крупный заголовок

# textRich.typography.titleText
source: Title
ru: Заголовок

# textRich.typography.body
source: Body text with regular weight and multiline support. This simulates a standard paragraph in your app.
ru: Основной текст с обычным начертанием и переносами строк. Это имитация стандартного абзаца в вашем приложении.

# textRich.typography.caption
source: Caption / secondary text
ru: Подпись / второстепенный текст

# textRich.markdown.inline
source: **Bold** _italic_ ~strikethrough~ `inline code` and a [link](https://apple.com)
ru: **Жирный** _курсив_ ~зачёркнутый~ `встроенный код` и [ссылка](https://apple.com)

# textRich.markdown.list
source: You can mix lists: • First item • Second item • Third item
ru: Можно смешивать списки: • Первый пункт • Второй пункт • Третий пункт

# textRich.selectable.title
source: Selectable & monospaced
ru: Выделяемый и моноширинный текст

# textRich.selectable.paragraph
source: Tap and hold to select and copy this paragraph. This demonstrates textSelection(.enabled).
ru: Нажмите и удерживайте, чтобы выделить и скопировать этот абзац. Демонстрация textSelection(.enabled).

# textRich.selectable.monoDigits
source: Monospaced digits: 12:34:56
ru: Моноширинные цифры: 12:34:56

# textRich.selectable.label
source: With SF Symbol
ru: С SF Symbol

# textRich.attributed.prefix
source: Mix styles in a single
ru: Смешивайте стили в одном

# textRich.attributed.suffix
source: block, including color, weight and size.
ru: блоке, включая цвет, начертание и размер.

# uikitInterop.share.title
source: Share sheet (UIActivityViewController)
ru: Экран шаринга (UIActivityViewController)

# uikitInterop.share.subtitle
source: Presented from SwiftUI via UIViewControllerRepresentable.
ru: Показывается из SwiftUI через UIViewControllerRepresentable.

# uikitInterop.textView.title
source: Embedded UITextView
ru: Встроенный UITextView

# uikitInterop.textView.subtitle
source: UITextView wrapped in UIViewRepresentable with two-way binding.
ru: UITextView, обёрнутый в UIViewRepresentable с двусторонним связыванием.

# uikitInterop.textView.placeholder
source: This UITextView comes from UIKit.
ru: Этот UITextView пришёл из UIKit.

# uikitInterop.textView.currentLabel
source: Current text:
ru: Текущий текст:

# uikitInterop.slider.title
source: UISlider in SwiftUI
ru: UISlider в SwiftUI

# uikitInterop.slider.subtitle
source: Value is bridged via Coordinator to SwiftUI state.
ru: Значение передаётся через Coordinator в состояние SwiftUI.

# uikitInterop.share.item.currentText
source: Current text: %@
ru: Текущий текст: %@

# uikitInterop.share.item.sliderValue
source: Slider value: %@
ru: Значение слайдера: %@

# uikitInterop.slider.valueLabel
source: Slider value: %.2f
ru: Значение слайдера: %.2f

# widgets.overview.title
source: Overview
ru: Обзор

# widgets.overview.body
source: Widgets live in a separate WidgetKit target, and Live Activities in an ActivityKit target. They appear on the Lock Screen and in the Dynamic Island. This screen is a visual mock, not a real widget.
ru: Виджеты живут в отдельной цели WidgetKit, а Live Activities — в ActivityKit и показываются на экране блокировки и в Dynamic Island. Этот экран — визуальный мок, а не настоящий виджет.

# widgets.preview.widgets.title
source: Home screen widgets (mock)
ru: Виджеты на домашнем экране (мок)

# widgets.preview.widgets.subtitle
source: Small and medium widgets rendered using regular SwiftUI.
ru: Малый и средний виджеты, отображённые с помощью обычного SwiftUI.

# widgets.preview.liveActivity.title
source: Live Activity (mock)
ru: Live Activity (мок)

# widgets.preview.liveActivity.subtitle
source: Lock Screen / Dynamic Island style banner with live progress.
ru: Плашка в стиле экрана блокировки и Dynamic Island с живым прогрессом.

# widgets.steps.title
source: How to implement it for real
ru: Как реализовать по-настоящему

# widgets.steps.1.title
source: Create a Widget Extension target
ru: Создать цель Widget Extension

# widgets.steps.1.detail
source: WidgetKit file with `@main struct MyWidget: Widget` and a `TimelineProvider`.
ru: Файл для WidgetKit, `@main struct MyWidget: Widget` и `TimelineProvider`.

# widgets.steps.2.title
source: Prepare a shared model
ru: Подготовить общую модель

# widgets.steps.2.detail
source: Shared code in an SPM package or common module: `Entry`, date formatting, localization.
ru: Общий код в SPM-пакете или общем модуле: `Entry`, форматирование дат, локализация.

# widgets.steps.3.title
source: Add a Live Activity (ActivityKit)
ru: Добавить Live Activity (ActivityKit)

# widgets.steps.3.detail
source: Define `ActivityAttributes`, register the type, and call `Activity.request(...)` from the app.
ru: Описать `ActivityAttributes`, зарегистрировать тип и вызывать `Activity.request(...)` из приложения.

# widgets.steps.4.title
source: Configure deep links
ru: Настроить диплинки

# widgets.steps.4.detail
source: Taps on the widget or activity should open the right screen in the app (`URL` / `WidgetURL`).
ru: Клики по виджету или активности ведут на нужный экран приложения (`URL` / `WidgetURL`).

# widgets.steps.5.title
source: Respect platform limitations
ru: Учесть ограничения платформы

# widgets.steps.5.detail
source: Update frequency, small payload size, different families (`.systemSmall`, `.systemMedium`, `.accessoryInline`, etc.).
ru: Частота обновления, небольшой объём данных, разные семейства (`.systemSmall`, `.systemMedium`, `.accessoryInline` и т. п.).

# widgets.small.header
source: TODAY
ru: СЕГОДНЯ

# widgets.small.tasks
source: 8 tasks
ru: 8 задач

# widgets.small.dueSoon
source: 3 due soon
ru: 3 скоро дедлайн

# widgets.medium.title
source: Focus session
ru: Сессия фокуса

# widgets.medium.subtitle
source: Next break in 18 min
ru: Следующий перерыв через 18 мин

# widgets.medium.ofTotal
source: of 30
ru: из 30

# widgets.live.title
source: Order on the way
ru: Заказ в пути

# widgets.live.subtitle
source: Courier will arrive in 6 minutes
ru: Курьер прибудет через 6 минут

# widgets.live.eta
source: ETA 19:42
ru: Ожидаемое время 19:42

# networking.title
source: Networking
ru: Сеть

# networking.request.subtitle
source: Simple GET request via URLSession with JSON decoding.
ru: Простой GET-запрос через URLSession с декодированием JSON.

# networking.idle.hint
source: Press "Fetch sample" to call the API.
ru: Нажмите «Fetch sample», чтобы выполнить запрос.

# networking.loading
source: Loading...
ru: Загрузка...

# networking.label.origin
source: Origin (your IP as seen by server)
ru: Origin (ваш IP для сервера)

# networking.label.headers
source: Some headers
ru: Некоторые заголовки

# networking.label.error
source: Error
ru: Ошибка

# networking.button.reset
source: Reset
ru: Сбросить

# uikitInterop.title
source: UIKit Interop
ru: Интеграция с UIKit

# uikitInterop.share.button
source: Share (UIActivityViewController)
ru: Поделиться (UIActivityViewController)

# uikitInterop.share.message
source: Hello from ExampleApp
ru: Привет из ExampleApp
